In [1]:
import numpy as np
import pandas as pd

In [2]:
#we recall that np.random.randn() returns a np array of random values according to a normal distribution 
# centered in 0

##For create a DataFrame(data, index, columns)   It's alike pandas Series but we need another input : columns

df=pd.DataFrame(np.random.randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [3]:
df ## Essentially, here  we have 4 pandas Series such as W,X,Y,Z

          W         X         Y         Z
A  2.592859 -0.106939 -1.058537  0.194067
B -0.712646 -0.418643 -0.465172 -1.048562
C  0.281063  0.683727 -1.255078  1.534579
D -0.039519 -0.288083  0.375636  2.264958
E  0.573924  1.218650  0.982996  1.082211

In [4]:
 ### Due to a DataFrame is essentially a bulk of series which share index, we can easily print them out by
df['X']

A   -0.106939
B   -0.418643
C    0.683727
D   -0.288083
E    1.218650
Name: X, dtype: float64

In [5]:
df['X']['B']

-0.4186430639853424

In [9]:
df[['W','X']] # for getting values of 2 or more cols

          W         X
A  0.539577 -0.061769
B -1.379644 -0.136712
C -0.678340 -0.258501
D -0.123127 -0.274421
E -0.866614  0.495735

In [10]:
### We can create a new Series adding two the ones already existed

df['new'] = df['X']+df['Y']

In [11]:
df

          W         X         Y         Z       new
A  0.539577 -0.061769 -0.429299  0.307239 -0.491068
B -1.379644 -0.136712  0.449127 -0.112594  0.312416
C -0.678340 -0.258501  1.310774 -1.660374  1.052273
D -0.123127 -0.274421  0.221215  1.104163 -0.053206
E -0.866614  0.495735 -0.234488 -1.223894  0.261247

In [13]:
 #### For removing columns(wich means a Series) we use     .drop('new', axis= default 0, inplace = default False)
    ### Recalling axis refers to:
                                    # 0 = index or y axis
                                    # 1 = cols or x axis
    ### Recalling inplace refers to:
                                    # True means the DataFrame u r working with will be changed
                                    # False means the DataFrame u r working with will NOT be changed
                                    ### So if we put False or we leave it by default this will not remove
                                        # any column or index
                
                
df.drop('new', axis=1)

          W         X         Y         Z
A  0.539577 -0.061769 -0.429299  0.307239
B -1.379644 -0.136712  0.449127 -0.112594
C -0.678340 -0.258501  1.310774 -1.660374
D -0.123127 -0.274421  0.221215  1.104163
E -0.866614  0.495735 -0.234488 -1.223894

In [15]:
df               #### We check that 'new' was not actually removed, because we didnt told inplace=True to pyhton

          W         X         Y         Z       new
A  0.539577 -0.061769 -0.429299  0.307239 -0.491068
B -1.379644 -0.136712  0.449127 -0.112594  0.312416
C -0.678340 -0.258501  1.310774 -1.660374  1.052273
D -0.123127 -0.274421  0.221215  1.104163 -0.053206
E -0.866614  0.495735 -0.234488 -1.223894  0.261247

In [16]:
df.drop('new', axis=1, inplace=True)

In [17]:
df

          W         X         Y         Z
A  0.539577 -0.061769 -0.429299  0.307239
B -1.379644 -0.136712  0.449127 -0.112594
C -0.678340 -0.258501  1.310774 -1.660374
D -0.123127 -0.274421  0.221215  1.104163
E -0.866614  0.495735 -0.234488 -1.223894

In [18]:
# For working with ROWS we need to use .loc['']
df.loc['C']    ## This is a pd.Series as the cols are

W   -0.678340
X   -0.258501
Y    1.310774
Z   -1.660374
Name: C, dtype: float64

In [19]:
## Another way to grab ROWS is using .iloc[index of the row]. index of the row means the real location by counting

df.iloc[2]  #we know that row 'A' is actually the 0, row 'B' is the numbre 1, row 'C' is the number 2

W   -0.678340
X   -0.258501
Y    1.310774
Z   -1.660374
Name: C, dtype: float64

In [20]:
#### We can get a certain value by selecting with .loc

df.loc['A','W']

0.5395768208270075

In [21]:
df.loc[['A','B'] , ['W','Y']]

          W         Y
A  0.539577 -0.429299
B -1.379644  0.449127